app/controllers/account_controller.rb

  def create
    if request.post?
      @user = User.new(params[:user])
      if (Settings[:require_newacct_activation] == 'true')
        @user.status = 0 # not yet activated
      end
      if ENV['RECAPTCHA_PUBLIC_KEY']
        # save with recaptcha
        if (verify_recaptcha(@user) && @user.save)
---
INSERT INTO "users" ("status", "updated_at", "signature", "username", "password", "email", "created_at", "verifycode") VALUES(0, '2009-08-25 16:00:14', NULL, 'testuser', '88d7aecbfcf35e988f6a0c393e4aa31ef49074d4', 'test@test.com', '2009-08-25 16:00:14', NULL)